app/controllers/application_controller.rb

  def set_sidebar_content
    @tags = ActsAsTaggableOn::Tag.most_used(8)
    @recents = Post.limit(5)
---
SELECT  "posts".* FROM "posts"   ORDER BY "posts"."updated_at" DESC LIMIT 5