app/controllers/posts_controller.rb

  def index
    if params[:tagged]
      @posts = Post.scoped_posts(signed_in?).tagged_with(params[:tagged]).paginate(page: params[:page], per_page: 7)
    else
      @posts = Post.scoped_posts(signed_in?).paginate(page: params[:page], per_page: 7)
    end
    @tags = Post.tag_counts_on(:tags).to_a.sort_by { |t| t.name }
---
SELECT "posts".* FROM "posts" JOIN taggings posts_taggings_a94a8fe  ON posts_taggings_a94a8fe.taggable_id = posts.id AND posts_taggings_a94a8fe.taggable_type = 'Post' AND posts_taggings_a94a8fe.tag_id = 1 LEFT OUTER JOIN taggings posts_taggings_group  ON posts_taggings_group.taggable_id = posts.id AND posts_taggings_group.taggable_type = 'Post' GROUP BY posts.id HAVING COUNT(posts_taggings_group.taggable_id) = 1  ORDER BY "posts"."updated_at" DESC
SELECT "tags".* FROM "tags"  WHERE (LOWER(name) = LOWER('bob'))
SELECT  "posts".* FROM "posts"   ORDER BY "posts"."updated_at" DESC LIMIT 5
SELECT  "tags".* FROM "tags"   ORDER BY taggings_count desc LIMIT 10

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "created_at", "handle", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "test"], ["created_at", "2015-01-26 06:05:36.676243"], ["handle", "test"], ["title", "test"], ["updated_at", "2015-01-26 06:05:36.676243"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "handle" = ?, "title" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["handle", "what-i-learned-the-week-of-january-18th"], ["title", "What I learned the week of January 18th"], ["updated_at", "2015-01-26 03:34:01.344259"]]

  def set_post
    @post = Post.unscoped.find_by(handle: params[:handle])
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."handle" = 'what-i-learned-the-week-of-january-12th'  ORDER BY "posts"."updated_at" DESC LIMIT 1